Repository: btrask/Sequential
Catalog: *.lproj/PGPreference.strings
Languages: de, fr, it, ja, ru

source: Quits Sequential
de: Sequential beenden
fr: Quitter Sequential
it: Chiude Sequential
ja: Sequential を終了
ru: Выход из программы

source: Toggles full screen
de: Vollbild ein/aus
fr: Passer en mode plein écran
it: Passa dallo schermo pieno alla finestra
ja: フルスクリーン表示の切り替え
ru: Полноэкранный режим

source: The page to the right
de: Nach rechts gehen
fr: La page de droite
it: La pagina a destra
ja: 右のページに行く
ru: Страницу вправо

source: The page to the left
de: Nach links gehen
fr: La page de gauche
it: La pagina a sinistra
ja: 左のページに行く
ru: Страницу влево

source: The next page
de: Zur nächsten Seite gehen
fr: La page suivante
it: La pagina successiva
ja: 次のページへ進む
ru: Следующую страницу

source: The end of the image
de: Am Ende des Bildes
fr: La fin de l'image
it: La fine dell'immagine
ja: 画像の最後の部分
ru: Конца изображения

source: The beginning of the image
de: Am Anfang des Bildes
fr: Le début de l'image
it: L'inizio dell'immagine
ja: 画像の最初の部分
ru: Начала изображения

source: The top edge of the end side
de: Am oberen Ende der Endseite
it: Il lato alto della parte finale
ja: 画像の最後の側の上の部分
ru: Верхнего края конца изображения

source: Maximum depth:
de: Maximale Tiefe:
fr: Exploration des dossiers:
it: Profondità massima:
ja: フォルダに入る程度:

source: Primary mouse clicks move to:
de: Linke Maustaste:
fr: Le clic principal vous déplace vers
it: Il clic primario del mouse va a:
ja: マウスボタンのクリック：
ru: Левый щелчок переходит на:

source: When going backward, start at:
de: Beim Zurückgehen Start:
fr: Retour à l'image précédente:
it: Andando indietro iniziare a:
ja: 逆に進んだ時の位置：
ru: При переходе назад, начинать от:

source: Hold Control to preserve the current position.
de: Taste “ctrl” halten, um die aktuelle Position beizubehalten.
fr: Appuyez sur Ctrl pour conserver la position actuelle
it: Premere ctrl per mantere la posizione corrente.
ja: Control と同時でそのままの動きにする。
ru: Держите Control чтобы сохранить текущее положение.

source: Images:
de: Anzeige:
it: Immagini:
ja: 画像:
ru: Изображения:

source: Antialias when upscaling
de: Bei Vergrößerung Kanten glätten
it: Antialias in ingrandimento
ja: 画像を大きくしたらアンチエイリアスする
ru: Сглаживать при увеличении

source: Escape key:
de: Taste “esc”:
fr: La touche echap:
it: Il tasto Esc:
ja: Escape キー:
ru: Клавиша Escape:

source: Full screen:
de: Vollbild:
fr: Plein écran:
it: Schermo pieno su:
ja: フルスクリーン:
ru: Полоэкранный режим:

source: Background:
de: Hintergrund:
fr: Couleur de fond:
it: Sfondo:
ja: 背景:
ru: Фон:

source: Checkerboard
de: Schachbrettmuster
fr: Damier
it: A scacchi
ja: 市松模様
ru: В клеточку

source: Dim other screens
de: Andere Bildschirme abdunkeln
fr: Obscurcir les autres écrans
it: Oscura altri schermi
ja: ほかの画面を暗くする
ru: Приглушить другие мониторы

source: Check automatically
de: Automatisch prüfen
fr: Vérifier automatiquement
it: Controlla automaticamente
ja: 自動で確認する
ru: Проверять автоматически

source: Software update:
de: Softwareaktualisierung
fr: Mises à jour du logiciel:
it: Aggiornamenti software:
ja: ソフトウェア更新:
ru: Обновления:

source: When an update is available, you can install it by choosing Install Update… from the Sequential menu.
de: Wenn ein Update verfügbar ist, können Sie dies durch Auswahl von “Update installieren …” aus dem Sequential-Menü von installieren.
fr: Lorsqu'une mise à jour est disponible, vous pouvez l'installer en choisissant Installer la mise à jour… depuis le menu de Sequential.
it: Quando è disponibile un aggiornamento lo si può installare scegliendo Installa Aggiornamenti… dal menu Sequential.
ja: 更新がある場合、 Sequential メニュー > 更新をインストールする… を選択してインストールすることが出来ます。
ru: Автоматическая проверка на наличие обновлений каждую неделю. Если есть доступные обновления, вы можете установить их через Sequential > Установить обновление….

source: Upscale only
ja: 拡大のみ

source: Scale freely
ja: 自由に大きさを合わせる

source: Downscale only
ja: 縮小のみ
