#define NAME         "xadUnTar"
#define DISTRIBUTION "(LGPL) "
#define REVISION     "8"
#define DATE         "04.02.2005"

/*  $Id: xadUnTar.c,v 1.5 2006/02/15 17:52:35 stoecker Exp $
    xadUnTar - dearchives tar archives (also gzipped, bzipped, compressed)

    XAD library system for archive handling
    Copyright (C) 1998 and later by Dirk Stöcker <soft@dstoecker.de>

    This library is free software; you can redistribute it and/or
    modify it under the terms of the GNU Lesser General Public
    License as published by the Free Software Foundation; either
    version 2.1 of the License, or (at your option) any later version.

    This library is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with this library; if not, write to the Free Software
    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
*/

#include <proto/xadmaster.h>
#include <proto/exec.h>
#include <proto/dos.h>
#include <exec/memory.h>
#include <dos/dosasl.h>
#include <utility/hooks.h>
#include "SDI_version.h"
#include "SDI_compiler.h"
#define SDI_TO_ANSI
#include "SDI_ASM_STD_protos.h"

struct xadMasterBase *  xadMasterBase = 0;
struct DosLibrary *     DOSBase = 0;
struct ExecBase *       SysBase = 0;

#define MINPRINTSIZE    51200   /* 50KB */
#define NAMEBUFSIZE     512
#define PATBUFSIZE      (NAMEBUFSIZE*2+10)

#define PARAM \
  "FROM/A,DEST=DESTDIR,PASSWORD/K,FILE/M,"      \
  "NAMESIZE/K/N,FFS=OFS/S,SFS/S,"               \
  "INFO=LIST/S,Q=QUIET/S,AM=ASKMAKEDIR/S,"      \
  "OW=OVERWRITE/S,NA=NOABS/S,ND=NODATE/S,"      \
  "NE=NOEXTERN/S,NKP=NOKILLPART/S,NP=NOPROT/S," \
  "NT=NOTREE/S,SHORTNAME/S,NOPAXHEADER/S"

#define OPTIONS \
  "FROM        The input archive file (no patterns allowed)\n"          \
  "DESTDIR     The destination directory, not needed with INFO\n"       \
  "PASSWORD    A password for encrypted archives\n"                     \
  "FILE        Filename(s) (with patterns) to be extracted\n"           \
  "NAMESIZE    Names with more characters result in rename request\n"   \
  "FFS=OFS     Sets NAMESIZE to 30\n"                                   \
  "SFS         Sets NAMESIZE to 100\n"                                  \
  "INFO        Shows archive information without extracting\n"          \
  "QUIET       Turns of progress report and user interaction\n"         \
  "ASKMAKEDIR  You get asked before a directory is created\n"           \
  "OVERWRITE   Files are overwritten without asking\n"                  \
  "NOABS       Do not extract absolute path name parts\n"               \
  "NODATE      Creation date information gets not extracted\n"          \
  "NOEXTERN    Turns off usage of external clients\n"                   \
  "NOKILLPART  Do not delete partial or corrupt output files.\n"        \
  "NOPROT      Protection information gets not extracted\n"             \
  "NOTREE      Files are extracted without subdirectories\n"            \
  "SHORTNAME   Do not display path in progress report\n"                \
  "NOPAXHEADER Do not extract unhandled PaxHeader extension as file\n"

struct xHookArgs {
  STRPTR name;
  ULONG size;
  ULONG flags;
  ULONG lastprint;
  ULONG shortname;
};

struct Args {
  STRPTR   from;
  STRPTR   destdir;
  STRPTR   password;
  STRPTR * file;
  LONG *   namesize;
  ULONG    ffs;
  ULONG    sfs;
  ULONG    info;
  ULONG    quiet;
  ULONG    askmakedir;
  ULONG    overwrite;
  ULONG    noabs;
  ULONG    nodate;
  ULONG    noextern;
  ULONG    nokillpart;
  ULONG    noprot;
  ULONG    notree;
  ULONG    shortname;
  ULONG    nopaxheader;

  /* parameter, no ReadArgs part */
  ULONG    directrun;
  ULONG    printerr;
  ULONG    numextract;
};

struct TarHeader {              /* byte offset */
  UBYTE th_Name[100];           /*   0 */
  UBYTE th_Mode[8];             /* 100 */
  UBYTE th_UserID[8];           /* 108 */
  UBYTE th_GroupID[8];          /* 116 */
  UBYTE th_Size[12];            /* 124 */
  UBYTE th_MTime[12];           /* 136 */
  UBYTE th_Checksum[8];         /* 148 */
  UBYTE th_Typeflag;            /* 156 */
  UBYTE th_LinkName[100];       /* 157 */
  UBYTE th_Magic[6];            /* 257 */
  UBYTE th_Version[2];          /* 263 */
  UBYTE th_UserName[32];        /* 265 */
  UBYTE th_GroupName[32];       /* 297 */
  UBYTE th_DevMajor[8];         /* 329 */
  UBYTE th_DevMinor[8];         /* 337 */
  UBYTE th_Prefix[155];         /* 345 */
  UBYTE th_Pad[12];             /* 500 */
};

struct TarBlockInfo {
  struct Args *         Args;
  struct xadArchiveInfo *ArchiveInfo;
  UBYTE                 Block[512];
  UBYTE                 LongName[512*2];
  struct TarHeader      Header;
  ULONG                 CurSize;
  ULONG                 NumFile;
  ULONG                 NumDir;
  ULONG                 NumSpecial;
  LONG                  NeedToSkip; /* bytes */
  LONG                  NeedToSave; /* bytes */
  LONG                  EndBytes;
  struct Hook           Hook;
  struct xHookArgs      HookArgs;
  UBYTE                 Filename[NAMEBUFSIZE];
  UBYTE                 EndMode;
  UBYTE                 LongLinkMode;
  UBYTE                 LongNameMode;
};

/* Values used in Typeflag field.  */
#define TF_FILE         '0'  /* Regular file */
#define TF_AFILE        '\0' /* Regular file */
#define TF_LINK         '1'  /* Link */
#define TF_SYM          '2'  /* Reserved - but GNU tar uses this for links... */
